<?php

return [
    'init' => [
        'success' => 'Инициализация прошла успешна',
        'fail' => 'Произошла ошибка инициализации',
        'info' => 'Создана группа :group, путь к базовому классу :class',
    ],

    'make' => [
        'write_class_name' => 'Введите название класса',
        'write_route_name' => 'Введите название маршрута',
        'write_middlewares' => 'Введите промежуточное ПО через запятую (между промежуточным ПО должны быть запятая и пробел)',
        'select_contracts' => 'Выберите интерфейсы, которые должен будет реализовать тест',
        'write_success' => 'Класс :path успешно создан',
        'rewrite_success' => 'Класс :path успешно перезаписан',
        'route_not_found' => 'Маршрут с именем :name не найден',
        'test_already_exists' => 'Тест ":path" уже готов. Перезаписать?',
        'skipped' => 'Тест ":path" пропущен',
    ],

    'test' => [
        'skipped' => [
            'invalid_data' => 'Тест пропущен, так как вызываемый класс не реализует интерфейс передачи невалидных данных',
            'invalid_parameters' => 'Тест пропущен, так как вызываемый класс не реализует интерфейс передачи невалидных параметров',
        ],

        'errors' => [
            'route' => [
                'not_found' => 'Маршрут с именем :route_name не найден!',
                'not_contain_middlewares' => 'Маршрут не содержит промежуточного ПО :name',
                'different_amount_middlewares' => 'Маршрут содержит иное количество промежуточного ПО.',
            ],

            'resource' => [
                'parse' => 'Ошибка получения структуры ресурса :resource. Ошибка: ":error"',
            ],
        ],
    ],

    'tests' => [
        'select_route_groups' => 'Выберите группы маршрутов',
        'select_routes_by_group' => 'Выберите маршруты группе',
    ],
];
